Narin-Laboratory/libudawa-esp32/src/libudawa.h
// Shared attributes we want to request from the server
constexpr std::array<const char*, 1U> REQUESTED_FW_CHECK_SHARED_ATTRIBUTES = {
  FW_VER_KEY
};
const Attribute_Request_Callback fwCheckCb(&processFwCheckAttributeRequest, REQUESTED_FW_CHECK_SHARED_ATTRIBUTES.cbegin(), REQUESTED_FW_CHECK_SHARED_ATTRIBUTES.cend());

const OTA_Update_Callback tbOtaCb(&tbOtaProgressCb, &tbOtaFinishedCb, CURRENT_FIRMWARE_TITLE, CURRENT_FIRMWARE_VERSION, &updater, 40, 4096);
const Shared_Attribute_Callback tbSharedAttrUpdateCb(&processSharedAttributeUpdate);

BaseType_t xReturnedWifiKeeper;
BaseType_t xReturnedAlarm;
#ifdef USE_WIFI_OTA
BaseType_t xReturnedWifiOta;
#endif
BaseType_t xReturnedTB;
BaseType_t xReturnedIface;

TaskHandle_t xHandleWifiKeeper = NULL;
TaskHandle_t xHandleAlarm = NULL;
#ifdef USE_WIFI_OTA
TaskHandle_t xHandleWifiOta;
#endif
TaskHandle_t xHandleTB;
#ifdef USE_WEB_IFACE
TaskHandle_t xHandleIface;
#endif

SemaphoreHandle_t xSemaphoreSerialCoMCUWrite = NULL;
SemaphoreHandle_t xSemaphoreSerialCoMCURead = NULL;
SemaphoreHandle_t xSemaphoreUDPLogger = NULL;
SemaphoreHandle_t xSemaphoreSettings = NULL;
SemaphoreHandle_t xSemaphoreConfig = NULL;
SemaphoreHandle_t xSemaphoreConfigCoMCU = NULL;
SemaphoreHandle_t xSemaphoreTBSend = NULL;
SemaphoreHandle_t xSemaphoreWSSend = NULL;
SemaphoreHandle_t xSemaphoreCardLogger = NULL;

struct AlarmMessage
{
    uint16_t code;
    uint8_t color; 
    int32_t blinkCount; 
    uint16_t blinkDelay;
};
QueueHandle_t xQueueAlarm;


void startup() {
  ssl.setCACert(CA_CERT);
  const char *ssl_protos[] = {"mqtt"};
  ssl.setAlpnProtocols(ssl_protos);
  tbloggerCb = &onTbLogger;
  xQueueAlarm = xQueueCreate( 10, sizeof( struct AlarmMessage ) );

  if(xSemaphoreSerialCoMCUWrite == NULL){xSemaphoreSerialCoMCUWrite = xSemaphoreCreateMutex();}
  if(xSemaphoreSerialCoMCURead == NULL){xSemaphoreSerialCoMCURead = xSemaphoreCreateMutex();}
  if(xSemaphoreUDPLogger == NULL){xSemaphoreUDPLogger = xSemaphoreCreateMutex();}
  if(xSemaphoreSettings == NULL){xSemaphoreSettings = xSemaphoreCreateMutex();}
  if(xSemaphoreConfig == NULL){xSemaphoreConfig = xSemaphoreCreateMutex();}
  if(xSemaphoreConfigCoMCU == NULL){xSemaphoreConfigCoMCU = xSemaphoreCreateMutex();}
  if(xSemaphoreTBSend == NULL){xSemaphoreTBSend = xSemaphoreCreateMutex();}
  if(xSemaphoreWSSend == NULL){xSemaphoreWSSend = xSemaphoreCreateMutex();}
  if(xSemaphoreCardLogger == NULL){xSemaphoreCardLogger = xSemaphoreCreateMutex();}

  // put your setup code here, to run once:
  Serial.begin(115200);

  config.logLev = 5;
  log_manager->add_logger(&serial_logger);
  #ifdef USE_WIFI_LOGGER
  log_manager->add_logger(&udp_logger);
  #endif
  log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);
  if(!SPIFFS.begin(true))
  {
    //configReset();
    configLoadFailSafe();
    log_manager->error(PSTR(__func__), PSTR("Problem with SPIFFS file system. Failsafe config was loaded.\n"));
  }
  else
  {
    log_manager->info(PSTR(__func__), PSTR("Loading config...\n"));
    configLoad();
    log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);
  }

  log_manager->info(PSTR(__func__), PSTR("Firmware version %s compiled on %s.\n"), CURRENT_FIRMWARE_VERSION, COMPILED);

  if(config.ECP < 60000){
    config.CC++;
    if(config.CC >= 60){
      config.SM = true;
      setAlarm(0, 1, 1000000, 50);
    }
  }
  log_manager->warn(PSTR(__func__), PSTR("ECP: %d, CC: %d, SM: %s\n"), config.ECP, config.CC, config.SM ? PSTR("ENABLED") : PSTR("DISABLED"));

  config.ECP = 0;
  configSave();
  
  #ifdef USE_SERIAL2
    log_manager->debug(PSTR(__func__), PSTR("Serial 2 - CoMCU Activated!\n"));
    Serial2.begin(115200, SERIAL_8N1, S2_RX, S2_TX);
  #endif

  if(!config.SM)
  {
    #ifdef USE_DISK_LOG
    #ifdef USE_SDCARD_LOG
    setupCardLogger();
    #endif
    #endif

    rtcUpdate(0);
  }

  log_manager->debug(PSTR(__func__), PSTR("Startup time: %s\n"), rtc.getDateTime().c_str());

  int tBytes = SPIFFS.totalBytes(); 
  int uBytes = SPIFFS.usedBytes();
  log_manager->verbose(PSTR(__func__), PSTR("SPIFFS total bytes: %d, used bytes: %d, free space: %d.\n"), tBytes, uBytes, tBytes-uBytes);

  if(xHandleWifiKeeper == NULL){
    xReturnedWifiKeeper = xTaskCreatePinnedToCore(wifiKeeperTR, PSTR("wifiKeeper"), STACKSIZE_WIFIKEEPER, NULL, 1, &xHandleWifiKeeper, 1);
    if(xReturnedWifiKeeper == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task wifiKeeper has been created.\n"));
    }
  }

  if(xHandleAlarm == NULL){
    xReturnedAlarm = xTaskCreatePinnedToCore(setAlarmTR, PSTR("setAlarm"), STACKSIZE_SETALARM, NULL, 1, &xHandleAlarm, 1);
    if(xReturnedAlarm == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task setAlarm has been created.\n"));
    }
  }


  setAlarm(0, 0, 3, 50);
}


void udawa(){
  if(FLAG_REBOOT_COUNTDOWN){
    if( (millis() - TIMER_FLAG_REBOOT_COUNTDOWN) >= (REBOOT_COUNTDOWN * 1000)){
      log_manager->warn(PSTR(__func__),PSTR("Device rebooting...\n"));
      ESP.restart();
    }
    else{
      long countdown = ((REBOOT_COUNTDOWN * 1000) - (millis() - TIMER_FLAG_REBOOT_COUNTDOWN)) / 1000;
      log_manager->warn(PSTR(__func__), PSTR("Reboot countdown: %ds\n"), countdown);
    }
  }

  if(FLAG_SAVE_CONFIG && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SAVE_CONFIG = false;
    configSave();
  }
  if(FLAG_SAVE_CONFIGCOMCU && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SAVE_CONFIGCOMCU = false;
    configCoMCUSave();
  }
  if(FLAG_SYNC_CONFIGCOMCU && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SYNC_CONFIGCOMCU = false;
    syncConfigCoMCU();
  }
  if(FLAG_SAVE_SETTINGS && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SAVE_SETTINGS = false;
    onSaveSettings();
  }
  if(FLAG_SAVE_STATES && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SAVE_STATES = false;
    onSaveStates();
  }
  if(FLAG_SYNC_CLIENT_ATTR_0 && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SYNC_CLIENT_ATTR_0 = false;
    syncClientAttr(0);
  }
  if(FLAG_SYNC_CLIENT_ATTR_1 && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SYNC_CLIENT_ATTR_1 = false;
    syncClientAttr(1);
  }
  if(FLAG_SYNC_CLIENT_ATTR_2 && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SYNC_CLIENT_ATTR_2 = false;
    syncClientAttr(2);
  }
  if(FLAG_UPDATE_SPIFFS && !FLAG_TB_OTA_ACTIVATED){
    FLAG_UPDATE_SPIFFS = false;
    updateSpiffs();
  }

