Narin-Laboratory/libudawa-esp32/src/libudawa.h
  if(!FLAG_ECP_UPDATED && millis() > 30000 && !FLAG_TB_OTA_ACTIVATED){
    config.ECP = millis();
    FLAG_SAVE_CONFIG = true;
    FLAG_ECP_UPDATED = true;
  }

  if(!FLAG_SM_CLEARED && millis() > 60000 && !FLAG_TB_OTA_ACTIVATED){
    config.ECP = millis();
    config.CC = 0;
    FLAG_SAVE_CONFIG = true;
    FLAG_SM_CLEARED = true;
    log_manager->info(PSTR(__func__),PSTR("Safe mode cleared! Ready to reboot normally.\n"));
  }

  if(LAST_TB_CONNECTED != 0 && config.fIoT && tb.connected() && (millis() - LAST_TB_CONNECTED) > 10000 && 
    (millis() - LAST_TB_CONNECTED) < 11000  && !FLAG_TB_OTA_ACTIVATED){
    FLAG_SYNC_CLIENT_ATTR_1 = true;
    LAST_TB_CONNECTED = 0;
  }

  if(LAST_TB_CONNECTED != 0 && config.fIoT && tb.connected() && (millis() - LAST_TB_CONNECTED) > 20000 &&
    (millis() - LAST_TB_CONNECTED) < 21000 && !FLAG_TB_OTA_ACTIVATED){
    onTbConnectedCb();
    LAST_TB_CONNECTED = 0;
  }
}

void onTbLogger(const char *error){
  if (config.logLev == 6)
  {
    log_manager->verbose(PSTR(__func__), PSTR("%s.\n"), error);
  }
}

/// @brief Update callback that will be called as soon as the requested shared attributes, have been received.
/// The callback will then not be called anymore unless it is reused for another request
/// @param data Data containing the shared attributes that were requested and their current value
void processSharedAttributeRequest(const Shared_Attribute_Data &data) {
  if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
  {
    log_manager->verbose(PSTR(__func__), PSTR("Received shared attribute(s).\n"));
    if(config.logLev == 5){serializeJson(data, Serial); Serial.println();}
    xSemaphoreGive( xSemaphoreTBSend );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}

/// @brief Update callback that will be called as soon as the requested client-side attributes, have been received.
/// The callback will then not be called anymore unless it is reused for another request
/// @param data Data containing the client-side attributes that were requested and their current value
void processClientAttributeRequest(const Shared_Attribute_Data &data) {
  if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
  {
    log_manager->verbose(PSTR(__func__), PSTR("Received client attribute(s).\n"));
    if(config.logLev == 5){serializeJson(data, Serial); Serial.println();}
    xSemaphoreGive( xSemaphoreTBSend );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}

void processSharedAttributeUpdate(const Shared_Attribute_Data &data){
  if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
  {
    log_manager->verbose(PSTR(__func__), PSTR("Received shared attribute(s) update: \n"));
    if(config.logLev >= 5){
      String buffer;
      serializeJson(data, buffer); 
      log_manager->verbose(PSTR(__func__), PSTR("%s \n"), buffer.c_str());
    }
    if( xSemaphoreConfig != NULL ){
      if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
      {
        if(data["model"] != nullptr){strlcpy(config.model, data["model"].as<const char*>(), sizeof(config.model));}
        if(data["group"] != nullptr){strlcpy(config.group, data["group"].as<const char*>(), sizeof(config.group));}
        if(data["broker"] != nullptr){strlcpy(config.broker, data["broker"].as<const char*>(), sizeof(config.broker));}
        if(data["port"] != nullptr){config.port = data["port"].as<uint16_t>();}
        if(data["wssid"] != nullptr){strlcpy(config.wssid, data["wssid"].as<const char*>(), sizeof(config.wssid));}
        if(data["wpass"] != nullptr){strlcpy(config.wpass, data["wpass"].as<const char*>(), sizeof(config.wpass));}
        if(data["dssid"] != nullptr){strlcpy(config.dssid, data["dssid"].as<const char*>(), sizeof(config.dssid));}
        if(data["dpass"] != nullptr){strlcpy(config.dpass, data["dpass"].as<const char*>(), sizeof(config.dpass));}
        if(data["upass"] != nullptr){strlcpy(config.upass, data["upass"].as<const char*>(), sizeof(config.upass));}
        if(data["accTkn"] != nullptr){strlcpy(config.accTkn, data["accTkn"].as<const char*>(), sizeof(config.accTkn));}
        if(data["provDK"] != nullptr){strlcpy(config.provDK, data["provDK"].as<const char*>(), sizeof(config.provDK));}
        if(data["provDS"] != nullptr){strlcpy(config.provDS, data["provDS"].as<const char*>(), sizeof(config.provDS));}
        if(data["logLev"] != nullptr){config.logLev = data["logLev"].as<uint8_t>(); log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);}
        if(data["gmtOff"] != nullptr){config.gmtOff = data["gmtOff"].as<int>();}
        if(data["htU"] != nullptr){strlcpy(config.htU, data["htU"].as<const char*>(), sizeof(config.htU));}
        if(data["htP"] != nullptr){strlcpy(config.htP, data["htP"].as<const char*>(), sizeof(config.htP));}
        if(data["fWOTA"] != nullptr){config.fWOTA = data["fWOTA"].as<bool>();}
        if(data["fIface"] != nullptr){config.fIface = data["fIface"].as<bool>();}
        if(data["fIoT"] != nullptr){config.fIoT = data["fIoT"].as<bool>();}
        if(data["hname"] != nullptr){strlcpy(config.hname, data["hname"].as<const char*>(), sizeof(config.hname));}
        if(data["logIP"] != nullptr){strlcpy(config.logIP, data["logIP"].as<const char*>(), sizeof(config.logIP));}
        if(data["webApiKey"] != nullptr){strlcpy(config.webApiKey, data["webApiKey"].as<const char*>(), sizeof(config.webApiKey));}
        if(data["logPrt"] != nullptr){config.logPrt = data["logPrt"].as<uint16_t>();}
        xSemaphoreGive( xSemaphoreConfig );
      }
      else
      {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
      }
    }

    if( xSemaphoreConfigCoMCU != NULL ){
      if( xSemaphoreTake( xSemaphoreConfigCoMCU, ( TickType_t ) 1000 ) == pdTRUE )
      {
        if(data["fP"] != nullptr){configcomcu.fP = data["fP"].as<bool>();}
        if(data["bFr"] != nullptr){configcomcu.bFr = data["bFr"].as<uint16_t>();}
        if(data["fB"] != nullptr){configcomcu.fB = data["fB"].as<bool>();}
        if(data["pBz"] != nullptr){configcomcu.pBz = data["pBz"].as<uint8_t>();}
        if(data["pLR"] != nullptr){configcomcu.pLR = data["pLR"].as<uint8_t>();}
        if(data["pLG"] != nullptr){configcomcu.pLG = data["pLG"].as<uint8_t>();}
        if(data["pLB"] != nullptr){configcomcu.pLB = data["pLB"].as<uint8_t>();}
        if(data["lON"] != nullptr){configcomcu.lON = data["lON"].as<uint8_t>();}
        xSemaphoreGive( xSemaphoreConfigCoMCU );
      }
      else
      {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
      }
    }
    processSharedAttributeUpdateCb(data);
    FLAG_SYNC_CLIENT_ATTR_2 = true;
    setAlarm(0, 0, 1, 50);
    xSemaphoreGive( xSemaphoreTBSend );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}

void tbOtaFinishedCb(const bool& success){
  onMQTTUpdateEndCb();
  if(success){
    log_manager->info(PSTR(__func__), PSTR("IoT OTA update success!\n"));
  }else{
    log_manager->warn(PSTR(__func__), PSTR("IoT OTA update failed!\n"));
  }
  reboot(0);
}

void tbOtaProgressCb(const uint32_t& currentChunk, const uint32_t& totalChuncks){
  log_manager->verbose(PSTR(__func__), PSTR("IoT OTA Progress %.2f%%\n"), static_cast<float>(currentChunk * 100U) / totalChuncks);
}

