Narin-Laboratory/libudawa-esp32/src/libudawa.h
#ifdef USE_WEB_IFACE
void ifaceTR(void *arg){
  #ifdef USE_ASYNC_WEB
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, OPTIONS");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type");
  #ifdef USE_INTERNAL_UI
    #ifdef USE_INTERNAL_UI_DIGEST
      web.serveStatic("/ui", SPIFFS, "/ui").setDefaultFile("index.html").setAuthentication(config.htU,config.htP).setAuthentication(config.htU,config.htP);
    #else
      web.serveStatic("/ui", SPIFFS, "/ui").setDefaultFile("index.html").setAuthentication(config.htU,config.htP);
    #endif
  #else
  web.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    DynamicJsonDocument jsonDoc(128);
    jsonDoc[PSTR("model")] = config.model;
    jsonDoc[PSTR("name")] = config.name;
    jsonDoc[PSTR("host")] = String(config.hname) + PSTR(".local");
    jsonDoc[PSTR("ipad")] = WiFi.localIP().toString();
    jsonDoc[PSTR("fwVer")] = CURRENT_FIRMWARE_VERSION;
    String jsonResponse = "";
    serializeJson(jsonDoc, jsonResponse);
    request->send(200, "application/json", jsonResponse);
  });
  #endif
  web.begin();
  #ifdef USE_SPIFFS_LOG
    #ifdef USE_INTERNAL_UI_DIGEST
      web.serveStatic("/log", SPIFFS, "/www/log").setDefaultFile("recover.json").setAuthentication(config.htU,config.htP);
    #else
      web.serveStatic("/log", SPIFFS, "/www/log").setDefaultFile("recover.json");
    #endif
  #endif
  #ifdef USE_SDCARD_LOG
  if(!config.SM){
    #ifdef USE_INTERNAL_UI_DIGEST
      web.serveStatic("/log", SD, "/www/log").setDefaultFile("recover.json").setAuthentication(config.htU,config.htP);
    #else
      web.serveStatic("/log", SD, "/www/log").setDefaultFile("recover.json");
    #endif
  }
  #endif
  ws.onEvent(onWsEventCb);
  ws.enable(true);
  web.addHandler(&ws);

  while(true){
    ws.cleanupClients();
    vTaskDelay((const TickType_t) 1000 / portTICK_PERIOD_MS);
  }
  #endif

  #ifndef USE_ASYNC_WEB
  web.on(PSTR("/"), []() { webSendFile("/www/index.html", "text/html"); });
  web.on(PSTR("/runtime.js"), []() { webSendFile("/www/runtime.js", "application/javascript"); });
  web.on(PSTR("/polyfills.js"), []() { webSendFile("/www/polyfills.js", "application/javascript"); });
  web.on(PSTR("/main.js"), []() { webSendFile("/www/main.js", "application/javascript"); });
  web.on(PSTR("/styles.css"), []() { webSendFile("/www/styles.css", "text/css"); });
  web.on(PSTR("/assets/img/logo.svg"), []() { webSendFile("/www/assets/img/logo.svg", "image/svg+xml"); });
  web.on(PSTR("/favicon"), []() { webSendFile("/www/favicon.ico", "image/x-icon"); });

  web.begin();

  ws.begin();
  ws.onEvent(onWsEventCb);

  while(true){
    ws.loop();
    web.handleClient();
    vTaskDelay((const TickType_t) 3 / portTICK_PERIOD_MS);
  }
  #endif
}
#endif

#ifdef USE_WIFI_OTA
void wifiOtaTR(void *arg){
  if(config.fWOTA){
    ArduinoOTA.setHostname(config.hname);
    ArduinoOTA.setPasswordHash(config.upass);
    ArduinoOTA.begin();

    ArduinoOTA
      .onStart([]()
      {
        String type;
        if (ArduinoOTA.getCommand() == U_FLASH)
            type = "sketch";
        else // U_SPIFFS
            type = "filesystem";
            SPIFFS.end();
        log_manager->warn(PSTR(__func__),PSTR("Starting OTA %s\n"), type.c_str());
        setAlarm(0, 2, 1000, 50);
        onMQTTUpdateStartCb();
      })
      .onEnd([]()
      {
        log_manager->warn(PSTR(__func__),PSTR("Device rebooting...\n"));
        setAlarm(0, 0, 0, 1000);
        reboot(0);
      })
      .onProgress([](unsigned int progress, unsigned int total)
      {
        //log_manager->warn(PSTR(__func__),PSTR("OTA progress: %d/%d\n"), progress, total);
      })
      .onError([](ota_error_t error)
      {
        log_manager->warn(PSTR(__func__),PSTR("OTA Failed: %d\n"), error);
        reboot(0);
      }
    );
  }
  while(true){
    if(config.fWOTA){
      if( xSemaphoreUDPLogger != NULL && xSemaphoreTake( xSemaphoreUDPLogger, ( TickType_t ) 1000 ) == pdTRUE )
      {
        ArduinoOTA.handle();
        xSemaphoreGive( xSemaphoreUDPLogger );
      }
    }
    vTaskDelay((const TickType_t) 1000 / portTICK_PERIOD_MS);
  }
}
#endif

void processProvisionResponse(const Provision_Data &data)
{
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && !config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      constexpr char CREDENTIALS_TYPE[] PROGMEM = "credentialsType";
      constexpr char CREDENTIALS_VALUE[] PROGMEM = "credentialsValue";
      int jsonSize = JSON_STRING_SIZE(measureJson(data));
      char buffer[jsonSize];
      serializeJson(data, buffer, jsonSize);
      log_manager->verbose(PSTR(__func__),PSTR("Received device provision response: %s\n"), buffer);

      if (strncmp(data["status"], "SUCCESS", strlen("SUCCESS")) != 0) {
        log_manager->warn(PSTR(__func__),PSTR("Provision response contains the error: (%s)\n"), data["errorMsg"].as<const char*>());
      }
      else
      {
        if (strncmp(data[CREDENTIALS_TYPE], PSTR("ACCESS_TOKEN"), strlen(PSTR("ACCESS_TOKEN"))) == 0) {
          strlcpy(config.accTkn, data[CREDENTIALS_VALUE].as<std::string>().c_str(), sizeof(config.accTkn));
          config.provSent = true;  
          FLAG_SAVE_CONFIG = true;
          log_manager->verbose(PSTR(__func__),PSTR("Access token provision response saved.\n"));
        }
        else if (strncmp(data[CREDENTIALS_TYPE], PSTR("MQTT_BASIC"), strlen(PSTR("MQTT_BASIC"))) == 0) {
          /*auto credentials_value = data[CREDENTIALS_VALUE].as<JsonObjectConst>();
          credentials.client_id = credentials_value[CLIENT_ID].as<std::string>();
          credentials.username = credentials_value[CLIENT_USERNAME].as<std::string>();
          credentials.password = credentials_value[CLIENT_PASSWORD].as<std::string>();*/
        }
        else {
          log_manager->warn(PSTR(__func__),PSTR("Unexpected provision credentialsType: (%s)\n"), data[CREDENTIALS_TYPE].as<const char*>());

