Narin-Laboratory/libudawa-esp32/src/libudawa.h
        }
      }

      // Disconnect from the cloud client connected to the provision account, because it is no longer needed the device has been provisioned
      // and we can reconnect to the cloud with the newly generated credentials.
      if (tb.connected()) {
        tb.disconnect();
      }
      xSemaphoreGive( xSemaphoreTBSend );
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
}


void TBTR(void *arg){
  while(true){
    if(!config.provSent){
      if (tb.connect(config.broker, "provision", config.port)) {
        const Provision_Callback provisionCallback(Access_Token(), &processProvisionResponse, config.provDK, config.provDS, config.name);
        if(tb.Provision_Request(provisionCallback))
        {
          log_manager->info(PSTR(__func__),PSTR("Connected to provisioning server: %s:%d. Sending provisioning response: DK: %s, DS: %s, Name: %s \n"),  
            config.broker, config.port, config.provDK, config.provDS, config.name);
        }
      }
      else
      {
        log_manager->warn(PSTR(__func__),PSTR("Failed to connect to provisioning server: %s:%d\n"),  config.broker, config.port);
      }
      unsigned long timer = millis();
      while(true){
        tb.loop();
        if(config.provSent || (millis() - timer) > 10000){break;}
        vTaskDelay((const TickType_t)10 / portTICK_PERIOD_MS);
      }
    }
    else{
      if(!tb.connected())
      {
        log_manager->warn(PSTR(__func__),PSTR("IoT disconnected!\n"));
        onTbDisconnectedCb();
        log_manager->info(PSTR(__func__),PSTR("Connecting to broker %s:%d\n"), config.broker, config.port);
        uint8_t tbDisco = 0;
        while(!tb.connect(config.broker, config.accTkn, config.port, config.name)){  
          tbDisco++;
          log_manager->warn(PSTR(__func__),PSTR("Failed to connect to IoT Broker %s (%d)\n"), config.broker, tbDisco);
          if(tbDisco >= 10){
            if( xSemaphoreConfig != NULL ){
              if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
              {
                config.provSent = 0;
                xSemaphoreGive( xSemaphoreConfig );
              }
              else
              {
                log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
              }
            }
            tbDisco = 0;
            break;
          }
          vTaskDelay((const TickType_t)1000 / portTICK_PERIOD_MS);
        }

        if(tb.connected()){
          bool tbSharedUpdate_status = tb.Shared_Attributes_Subscribe(tbSharedAttrUpdateCb);
          bool tbClientRPC_status = tb.RPC_Subscribe(clientRPCCallbacks.cbegin(), clientRPCCallbacks.cend());
          tb.Firmware_Send_Info(CURRENT_FIRMWARE_TITLE, CURRENT_FIRMWARE_VERSION); 
          tb.Firmware_Send_State(PSTR("updated"));
          tb.Shared_Attributes_Request(fwCheckCb);

          LAST_TB_CONNECTED = millis();

          setAlarm(0, 0, 3, 50);
          log_manager->info(PSTR(__func__),PSTR("IoT Connected!\n"));
        }
      }
    }

    tb.loop();
    vTaskDelay((const TickType_t) 1 / portTICK_PERIOD_MS);
  }
}


void emitAlarm(int code){
  if(tb.connected()){
    StaticJsonDocument<32> doc;
    doc[PSTR("alarm")] = code;
    char buffer[32];
    serializeJson(doc, buffer);
    tbSendTelemetry(buffer);
  }
  emitAlarmCb(code);
  log_manager->error(PSTR(__func__), PSTR("%i\n"), code);
}

void rtcUpdate(long ts){
  #ifdef USE_HW_RTC
  bool rtcHwDetected = 0;
  if(!rtcHw.begin()){
    setAlarm(151, 1, 1, 5000);
    log_manager->debug(PSTR(__func__), PSTR("RTC Hardware not found; please update the device time manually. Any function that requires precise timing will malfunction! \n"));
  }
  else{
    rtcHwDetected = 1;
    rtcHw.setSquareWave(SquareWaveDisable);
  }
  #endif
  if(ts == 0){
    configTime(config.gmtOff, 0, "pool.ntp.org");
    bool ntpSuccess = timeClient.update();
    if (ntpSuccess){
      long epochTime = timeClient.getEpochTime();
      rtc.setTime(epochTime);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via NTP: %s GMT Offset:%d (%d) \n"), rtc.getDateTime().c_str(), config.gmtOff, config.gmtOff / 3600);
      #ifdef USE_HW_RTC
      if(rtcHwDetected){
        log_manager->debug(PSTR(__func__), PSTR("Updating RTC HW from NTP...\n"));
        rtcHw.setDateTime(rtc.getHour(), rtc.getMinute(), rtc.getSecond(), rtc.getDay(), rtc.getMonth()+1, rtc.getYear(), rtc.getDayofWeek());
        log_manager->debug(PSTR(__func__), PSTR("Updated RTC HW from NTP with epoch %d | H:I:S W D-M-Y. -> %d:%d:%d %d %d-%d-%d\n"), 
        rtcHw.getEpoch(), rtc.getHour(), rtc.getMinute(), rtc.getSecond(), rtc.getDayofWeek(), rtc.getDay(), rtc.getMonth()+1, rtc.getYear());
      }
      #endif
    }else{
      #ifdef USE_HW_RTC
      if(rtcHwDetected){
        log_manager->debug(PSTR(__func__), PSTR("Updating RTC from RTC HW with epoch %d.\n"), rtcHw.getEpoch());
        rtc.setTime(rtcHw.getEpoch());
        log_manager->debug(PSTR(__func__), PSTR("Updated time via RTC HW: %s GMT Offset:%d (%d) \n"), rtc.getDateTime().c_str(), config.gmtOff, config.gmtOff / 3600);
      }
      #endif
    }
  }else{
      rtc.setTime(ts);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via timestamp: %s\n"), rtc.getDateTime().c_str());
  }
}

void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->warn(PSTR(__func__),PSTR("WiFi %s disconnected!\n"), WiFi.SSID().c_str());
}

void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info)
{
  String ip = WiFi.localIP().toString();
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s) IP Assigned: %s!\n"), WiFi.SSID().c_str(), ip.c_str());

  MDNS.begin(config.hname);
  MDNS.addService("http", "tcp", 80);
  log_manager->info(PSTR(__func__),PSTR("Started MDNS on %s\n"), config.hname);

  timeClient.begin();

  rtcUpdate(0);

  #ifdef USE_WIFI_LOGGER  
  if(!config.SM){
    udp.begin(config.logPrt);
  }
  #endif

  #ifdef USE_WIFI_OTA
  if(config.fWOTA && xHandleWifiOta == NULL){
    xReturnedWifiOta = xTaskCreatePinnedToCore(wifiOtaTR, "wifiOta", STACKSIZE_WIFIOTA, NULL, 1, &xHandleWifiOta, 1);
    if(xReturnedWifiOta == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task wifiOta has been created.\n"));
    }
  }
  #endif

