Narin-Laboratory/libudawa-esp32/src/libudawa.h
  if(config.fIoT && xHandleTB == NULL && !config.SM){
    xReturnedTB = xTaskCreatePinnedToCore(TBTR, "TB", STACKSIZE_TB, NULL, 1, &xHandleTB, 1);
    if(xReturnedTB == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task TB has been created.\n"));
    }
  }

  #ifdef USE_WEB_IFACE
  if(config.fIface && xHandleIface == NULL && !config.SM){
    xReturnedIface = xTaskCreatePinnedToCore(ifaceTR, "iface", STACKSIZE_IFACE, NULL, 1, &xHandleIface, 1);
    if(xReturnedIface == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task iface has been created.\n"));
    }
  }
  #endif

  if(rtc.getYear() < 2023){
    setAlarm(131, 1, 5, 1000);
  }

  setAlarm(0, 0, 3, 50);
}


void wifiKeeperTR(void *arg){
  log_manager->debug(PSTR(__func__),PSTR("Initializing wifi network...\n"));
  WiFi.mode(WIFI_STA);
  WiFi.setHostname(config.hname);
  WiFi.setAutoReconnect(true);
  if(!config.wssid || *config.wssid == 0x00 || strlen(config.wssid) > 48)
  {
    configLoadFailSafe();
    log_manager->warn(PSTR(__func__), PSTR("SSID too long or missing! Failsafe config was loaded.\n"));
  }
  wifiMulti.addAP(config.wssid, config.wpass);
  wifiMulti.addAP(config.dssid, config.dpass);

  WiFi.onEvent(cbWiFiOnDisconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
  WiFi.onEvent(cbWiFiOnGotIp, ARDUINO_EVENT_WIFI_STA_GOT_IP);
  
  while (true)
  {
    wifiMulti.run();
    vTaskDelay((const TickType_t) 30000 / portTICK_PERIOD_MS);
  }
}

#ifdef USE_WEB_IFACE
#ifdef USE_ASYNC_WEB
void onWsEventCb(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len){
  StaticJsonDocument<DOCSIZE_MIN> root;
  JsonObject doc = root.to<JsonObject>();
  IPAddress clientIP = client->remoteIP();
  switch(type) {
    case WS_EVT_DISCONNECT:
      {
        log_manager->verbose(PSTR(__func__), PSTR("Client disconnected [%s]\n"), client->remoteIP().toString().c_str());
        // Remove client from maps
        clientAuthenticationStatus.erase(client->id());
        clientAuthAttemptTimestamps.erase(clientIP);

        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            if(config.wsCount > 0){
              config.wsCount--;
            }
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
              log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
          }
        }
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] disconnect. WsCount: %d\n"), client->id(), config.wsCount);
        doc["evType"] = (int)WS_EVT_DISCONNECT;
        doc["num"] = client->id();
        wsEventCb(doc);
      }
      break;
    case WS_EVT_CONNECT:
      {
        log_manager->verbose(PSTR(__func__), PSTR("New client arrived [%s]\n"), client->remoteIP().toString().c_str());
        // Initialize client as unauthenticated
        clientAuthenticationStatus[client->id()] = false;
        // Initialize timestamp for rate limiting
      }
      break;
    case WS_EVT_DATA:
      {
        DeserializationError err = deserializeJson(root, data);
        if(err != DeserializationError::Ok){
          return;
        }

        String dataLog;
        serializeJson(root, dataLog);
        log_manager->verbose(PSTR(__func__), PSTR("WS Data (%s): %s\n"), err.c_str(), dataLog.c_str());

        
        // If client is not authenticated, check credentials
        if(!clientAuthenticationStatus[client->id()]) {
          unsigned long currentTime = millis();
          unsigned long lastAttemptTime = clientAuthAttemptTimestamps[clientIP];

          if (currentTime - lastAttemptTime < config.rateLimitInterval) {
            // Too many attempts in short time, block this IP for blockInterval
            clientAuthAttemptTimestamps[clientIP] = currentTime + config.blockInterval - config.rateLimitInterval;
            log_manager->verbose(PSTR(__func__), PSTR("Too many authentication attempts. Blocking for %d seconds. Rate limit %d.\n"), config.blockInterval / 1000, config.rateLimitInterval);
            client->text(PSTR("{\"status\": {\"code\": 429, \"msg\": \"Too many authentication attempts. Please wait for 60 seconds.\"}}"));
            client->close();
            return;
          }
          
          clientAuthAttemptTimestamps[clientIP] = millis();

          if (err != DeserializationError::Ok) {
            client->text(PSTR("{\"status\": {\"code\": 400, \"msg\": \"Bad request.\"}}"));
            //client->close();
            return;
          }
          else{
            if(doc["salt"] == nullptr || doc["auth"] == nullptr){
              //client->text(PSTR("{\"status\": {\"code\": 401, \"msg\": \"Unauthorized.\"}}"));
              //client->close();
              return;
            }

            const char* salt = doc["salt"];
            const char* auth = doc["auth"];

            char hashedApiKey[65];          
            hashApiKeyWithSalt(config.webApiKey, salt, hashedApiKey);
          
            if (strcmp(auth, hashedApiKey) == 0) {
              // Client authenticated successfully, update the status in the map
              clientAuthenticationStatus[client->id()] = true;
              if( xSemaphoreConfig != NULL ){
                if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
                {
                  config.wsCount++;
                  xSemaphoreGive( xSemaphoreConfig );
                }
                else
                {
                    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
                }
              }
              char broadcastModel[128];
              sprintf(broadcastModel, PSTR("{\"status\": {\"code\": 200, \"msg\": \"Authorized.\", \"model\": \"%s\"}}"), config.model);
              client->text(broadcastModel);
              log_manager->debug(PSTR(__func__), PSTR("ws [%u] authenticated. WsCount: %d\n"), client->id(), config.wsCount);
              doc["evType"] = (int)WS_EVT_CONNECT;
              doc["num"] = client->id();
              wsEventCb(doc);
            } else {
              // Unauthorized, you can choose to disconnect the client
              client->text(PSTR("{\"status\": {\"code\": 401, \"msg\": \"Unauthorized.\"}}"));
              client->close();
            }

