Narin-Laboratory/libudawa-esp32/src/libudawa.h
            // Update timestamp for rate limiting
            clientAuthAttemptTimestamps[clientIP] = currentTime;
          }
        }
        else {
          // The client is already authenticated, you can process the received data
          if (err == DeserializationError::Ok)
          {
            log_manager->debug(PSTR(__func__), PSTR("WS message parsing %s\n"), err.c_str());
            doc["evType"] = (int)WS_EVT_DATA;
            doc["num"] = client->id();
            wsEventCb(doc);
          }
          else
          {
            log_manager->warn(PSTR(__func__), PSTR("WS message parsing error: %s\n"), err.c_str());
          }
        }
      }
      break;
    case WS_EVT_ERROR:
      {
        log_manager->warn(PSTR(__func__), PSTR("ws [%u] error\n"), client->id());
        doc["evType"] = (int)WS_EVT_ERROR;
        doc["num"] = client->id();
        wsEventCb(doc);
      }
      break;	
  }
}
#endif
#ifndef USE_ASYNC_WEB
void onWsEventCb(uint8_t num, WStype_t type, uint8_t * data, size_t length){
  StaticJsonDocument<DOCSIZE_MIN> root;
  JsonObject doc = root.to<JsonObject>();
  switch(type) {
    case WStype_DISCONNECTED:
      {
        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            if(config.wsCount > 0){
              config.wsCount--;
            }
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
              log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
          }
        }
        
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] disconnect. WsCount: %d\n"), num, config.wsCount);
        doc["evType"] = (int)WStype_DISCONNECTED;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;
    case WStype_CONNECTED:
      {
        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            config.wsCount++;
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
              log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
          }
        }
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] connect. WsCount: %d\n"), num, config.wsCount);
        doc["evType"] = (int)WStype_CONNECTED;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;
    case WStype_TEXT:
      {
        DeserializationError err = deserializeJson(root, data);
        if (err == DeserializationError::Ok)
        {
          log_manager->debug(PSTR(__func__), PSTR("WS message parsing %s\n"), err.c_str());
          doc["evType"] = (int)WStype_TEXT;
          doc["num"] = num;
          wsEventCb(doc);
        }
        else
        {
          log_manager->warn(PSTR(__func__), PSTR("WS message parsing error: %s\n"), err.c_str());
        }
      }
      break;
    case WStype_ERROR:
      {
        log_manager->warn(PSTR(__func__), PSTR("ws [%u] error\n"), num);
        doc["evType"] = (int)WStype_ERROR;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;	
  }
}
#endif
#endif

void setBuzzer(int32_t beepCount, uint16_t beepDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  doc["method"] = "sBuz";
  params["beepCount"] = beepCount;
  params["beepDelay"] = beepDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
uint8_t r, g, b;
  switch (color)
  {
  //Auto by network
  case 0:
    if(tb.connected()){
      r = configcomcu.lON == 0 ? 255 : 0;
      g = configcomcu.lON == 0 ? 255 : 0;
      b = configcomcu.lON;
    }
    else if(WiFi.status() == WL_CONNECTED){
      r = configcomcu.lON == 0 ? 255 : 0;
      g = configcomcu.lON;
      b = configcomcu.lON == 0 ? 255 : 0;
    }
    else{
      r = configcomcu.lON;
      g = configcomcu.lON == 0 ? 255 : 0;
      b = configcomcu.lON == 0 ? 255 : 0;
    }
    break;
  //RED
  case 1:
    r = configcomcu.lON;
    g = configcomcu.lON == 0 ? 255 : 0;
    b = configcomcu.lON == 0 ? 255 : 0;
    break;
  //GREEN
  case 2:
    r = configcomcu.lON == 0 ? 255 : 0;
    g = configcomcu.lON;
    b = configcomcu.lON == 0 ? 255 : 0;
    break;
  //BLUE
  case 3:
    r = configcomcu.lON == 0 ? 255 : 0;
    g = configcomcu.lON == 0 ? 255 : 0;
    b = configcomcu.lON;
    break;
  default:
    r = configcomcu.lON;
    g = configcomcu.lON;
    b = configcomcu.lON;
  }
  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["method"] = "sLed";
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay){
  if( xQueueAlarm != NULL ){
    AlarmMessage alarmMsg;
    alarmMsg.code = code; alarmMsg.color = color; alarmMsg.blinkCount = blinkCount; alarmMsg.blinkDelay = blinkDelay;
    if( xQueueSend( xQueueAlarm, &alarmMsg, ( TickType_t ) 1000 ) != pdPASS )
    {
        log_manager->debug(PSTR(__func__), PSTR("Failed to set alarm. Queue is full. \n"));
    }
  }
}

void setAlarmTR(void *arg){
  while(true){
    if( xQueueAlarm != NULL ){
      AlarmMessage alarmMsg;
      if( xQueueReceive( xQueueAlarm,  &( alarmMsg ), ( TickType_t ) 100 ) == pdPASS )
      {
        #ifdef USE_SERIAL2
        setLed(alarmMsg.color, 1, alarmMsg.blinkCount, alarmMsg.blinkDelay);
        setBuzzer(alarmMsg.blinkCount, alarmMsg.blinkDelay);
        #endif
        if(alarmMsg.code > 0){
          emitAlarm(alarmMsg.code);
        }
        vTaskDelay((const TickType_t) (alarmMsg.blinkCount * alarmMsg.blinkDelay) / portTICK_PERIOD_MS);
      }
    }
    vTaskDelay((const TickType_t) 100 / portTICK_PERIOD_MS);
  }
}

void reboot(int countdown = 0)
{
  log_manager->info(PSTR(__func__),PSTR("Device rebot scheduled in %ds\n"), countdown);
  if(countdown > 0){
    TIMER_FLAG_REBOOT_COUNTDOWN = millis();
    REBOOT_COUNTDOWN = countdown;
    FLAG_REBOOT_COUNTDOWN = true;
  }
  else{
    log_manager->warn(PSTR(__func__),PSTR("Device rebooting...\n"));
    /*esp_task_wdt_init(1,true);
    esp_task_wdt_add(NULL);
    while(true);*/
    ESP.restart();
  }
}

char* getDeviceId()
{
  char* decodedString = new char[16];
  uint64_t chipid = ESP.getEfuseMac();
  sprintf(decodedString, "%04X%08X",(uint16_t)(chipid>>32), (uint32_t)chipid);
  return decodedString;
}

