Narin-Laboratory/libudawa-esp32/src/libudawa.h
  StaticJsonDocument<DOCSIZE_MIN> doc;
  char buffer[384];

  if(tb.connected() && (direction == 0 || direction == 1) ){
    doc[PSTR("ipad")] = ip;
    doc[PSTR("compdate")] = COMPILED;
    doc[PSTR("fmTitle")] = CURRENT_FIRMWARE_TITLE;
    doc[PSTR("fmVersion")] = CURRENT_FIRMWARE_VERSION;
    doc[PSTR("stamac")] = WiFi.macAddress();
    doc[PSTR("apmac")] = WiFi.softAPmacAddress();
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("flFree")] = ESP.getFreeSketchSpace();
    doc[PSTR("fwSize")] = ESP.getSketchSize();
    doc[PSTR("flSize")] = ESP.getFlashChipSize();
    doc[PSTR("dSize")] = (int)SPIFFS.totalBytes(); 
    doc[PSTR("dUsed")] = (int)SPIFFS.usedBytes();
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("sdkVer")] = ESP.getSdkVersion();
    doc[PSTR("model")] = config.model;
    doc[PSTR("name")] = config.name;
    doc[PSTR("group")] = config.group;
    doc[PSTR("broker")] = config.broker;
    doc[PSTR("port")] = config.port;
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("wssid")] = config.wssid;
    doc[PSTR("ap")] = WiFi.SSID();
    doc[PSTR("wpass")] = config.wpass;
    doc[PSTR("dssid")] = config.dssid;
    doc[PSTR("dpass")] = config.dpass;
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("upass")] = config.upass;
    doc[PSTR("accTkn")] = config.accTkn;
    doc[PSTR("webApiKey")] = config.webApiKey;
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("provDK")] = config.provDK;
    doc[PSTR("provDS")] = config.provDS;
    doc[PSTR("logLev")] = config.logLev;
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("gmtOff")] = config.gmtOff;
    doc[PSTR("bFr")] = configcomcu.bFr;
    doc[PSTR("fP")] = (int)configcomcu.fP;
    doc[PSTR("fB")] = (int)configcomcu.fB;
    doc[PSTR("fIoT")] = (int)config.fIoT;
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("fWOTA")] = (int)config.fWOTA;
    doc[PSTR("fIface")] = (int)config.fIface;
    doc[PSTR("hname")] = config.hname;
    doc[PSTR("logIP")] = config.logIP;
    doc[PSTR("logPrt")] = config.logPrt;
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("pBz")] = configcomcu.pBz;
    doc[PSTR("pLR")] = configcomcu.pLR;
    doc[PSTR("pLG")] = configcomcu.pLG;
    doc[PSTR("pLB")] = configcomcu.pLB;
    doc[PSTR("htU")] = config.htU;
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
    doc[PSTR("htP")] = config.htP;
    doc[PSTR("lON")] = configcomcu.lON;
    #ifdef USE_SDCARD_LOG
    doc[PSTR("crByte")] = config.cardByte;
    doc[PSTR("crSize")] = config.cardSize;
    doc[PSTR("crUsed")] = config.cardUsed;
    #endif
    serializeJson(doc, buffer);
    tbSendAttribute(buffer);
    doc.clear();
  }

  #ifdef USE_WEB_IFACE
  if(config.wsCount > 0 && (direction == 0 || direction == 2)){
    JsonObject attr = doc.createNestedObject("attr");
    attr[PSTR("ipad")] = ip.c_str();
    attr[PSTR("compdate")] = COMPILED;
    attr[PSTR("fmTitle")] = CURRENT_FIRMWARE_TITLE;
    attr[PSTR("fmVersion")] = CURRENT_FIRMWARE_VERSION;
    attr[PSTR("stamac")] = WiFi.macAddress();
    attr[PSTR("apmac")] = WiFi.softAPmacAddress();
    attr[PSTR("flFree")] = ESP.getFreeSketchSpace();
    attr[PSTR("fwSize")] = ESP.getSketchSize();
    attr[PSTR("flSize")] = ESP.getFlashChipSize();
    attr[PSTR("dSize")] = (int)SPIFFS.totalBytes(); 
    attr[PSTR("dUsed")] = (int)SPIFFS.usedBytes();
    attr[PSTR("sdkVer")] = ESP.getSdkVersion();
    #ifdef USE_SDCARD_LOG
    attr[PSTR("crByte")] = config.cardByte;
    attr[PSTR("crSize")] = config.cardSize;
    attr[PSTR("crUsed")] = config.cardUsed;
    #endif
    serializeJson(doc, buffer);
    wsBroadcastTXT(buffer);
    doc.clear();
    JsonObject cfg = doc.createNestedObject("cfg");
    cfg[PSTR("name")] = config.name;
    cfg[PSTR("model")] = config.model;
    cfg[PSTR("group")] = config.group;
    cfg[PSTR("ap")] = WiFi.SSID();
    cfg[PSTR("gmtOff")] = config.gmtOff;
    cfg[PSTR("fP")] = (int)configcomcu.fP;
    cfg[PSTR("fIoT")] = (int)config.fIoT;
    cfg[PSTR("hname")] = config.hname;
    serializeJson(doc, buffer);
    wsBroadcastTXT(buffer);
  }
  #endif

  onSyncClientAttrCb(direction);
}

bool tbSendAttribute(const char *buffer){
  bool res = false;
  int length = strlen(buffer);
  if (buffer[length - 1] != '}') {
      log_manager->verbose(PSTR(__func__),PSTR("The buffer is not JSON formatted!\n"));
      return false;
  }
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected() && config.accTkn != NULL){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      log_manager->verbose(PSTR(__func__), PSTR("Sending attribute to broker: %s\n"), buffer);
      res = tb.sendAttributeJSON(buffer);
      xSemaphoreGive( xSemaphoreTBSend );
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
  return res;
}

bool tbSendTelemetry(const char * buffer){
  bool res = false;
  int length = strlen(buffer);
  if (buffer[length - 1] != '}') {
      log_manager->verbose(PSTR(__func__),PSTR("The buffer is not JSON formatted!\n"));
      return false;
  }
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected() && config.accTkn != NULL){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      log_manager->verbose(PSTR(__func__), PSTR("Sending telemetry to broker: %s\n"), buffer);
      res = tb.sendTelemetryJson(buffer); 
      xSemaphoreGive( xSemaphoreTBSend );
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }   
  }
  return res;
}

RPC_Response processUpdateApp(const RPC_Data &data){
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      if(xHandleAlarm != NULL){vTaskSuspend(xHandleAlarm);}
      #ifdef USE_WIFI_OTA
      if(xHandleWifiOta != NULL){vTaskSuspend(xHandleWifiOta);}
      #endif
      FLAG_TB_OTA_ACTIVATED = true;
      onMQTTUpdateStartCb();
      setAlarm(0, 3, 65000, 50);
      tb.Start_Firmware_Update(tbOtaCb);
      reboot();
      xSemaphoreGive( xSemaphoreTBSend );
      return RPC_Response(PSTR("updateApp"), 1);
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
  return RPC_Response(PSTR("updateApp"), 1);
}

void processFwCheckAttributeRequest(const Shared_Attribute_Data &data){
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      if(data["fw_version"] != nullptr){
        log_manager->info(PSTR(__func__), PSTR("Firmware check local: %s vs cloud: %s\n"), CURRENT_FIRMWARE_VERSION, data["fw_version"].as<const char*>());
        if(strcmp(data["fw_version"].as<const char*>(), CURRENT_FIRMWARE_VERSION)){
          if(xHandleAlarm != NULL){vTaskSuspend(xHandleAlarm);}
          #ifdef USE_WIFI_OTA
          if(xHandleWifiOta != NULL){vTaskSuspend(xHandleWifiOta);}
          #endif
          FLAG_TB_OTA_ACTIVATED = true;
          onMQTTUpdateStartCb();
          setAlarm(0, 3, 65000, 50);
          tb.Start_Firmware_Update(tbOtaCb);
        }
      }
      xSemaphoreGive( xSemaphoreTBSend );
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
}

