Narin-Laboratory/libudawa-esp32/src/libudawa.h
#ifdef USE_WEB_IFACE
bool wsBroadcastTXT(const char *buffer){
  bool res = false;
  if(config.fIface && config.wsCount > 0){
    int length = strlen(buffer);
    if (buffer[length - 1] != '}') {
        log_manager->verbose(PSTR(__func__),PSTR("The buffer is not JSON formatted!\n"));
        return false;
    }
    if( xSemaphoreWSSend != NULL){
      if( xSemaphoreTake( xSemaphoreWSSend, ( TickType_t ) 1000 ) == pdTRUE )
      {
        #ifdef USE_ASYNC_WEB
        ws.cleanupClients(); // remove disconnected clients
        for(auto& it : clientAuthenticationStatus) {
            if(it.second) { // if the client is authenticated
                AsyncWebSocketClient* client = ws.client(it.first); // get the client using the client id
                if(client != nullptr) {
                    client->text(buffer);
                    if(config.logLev == 6){
                      log_manager->verbose(PSTR(__func__),PSTR("Broadcasted to websocket: %s\n"), buffer);
                    }
                }
            }
        }
        res = true;
        #endif
        #ifndef USE_ASYNC_WEB
        res = ws.broadcastTXT(buffer);
        #endif
        xSemaphoreGive( xSemaphoreWSSend );
      }
      else
      {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
      }
    }
  }
  return res;
}

bool wsSendTXT(uint32_t id, const char *buffer){
  bool res = false;
  if(config.fIface && config.wsCount > 0){
    int length = strlen(buffer);
    if (buffer[length - 1] != '}') {
        log_manager->verbose(PSTR(__func__),PSTR("The buffer is not JSON formatted!\n"));
        return false;
    }
    if( xSemaphoreWSSend != NULL){
      if( xSemaphoreTake( xSemaphoreWSSend, ( TickType_t ) 1000 ) == pdTRUE )
      {
        #ifdef USE_ASYNC_WEB
        ws.text(id, buffer);
        if(config.logLev == 6){
          log_manager->verbose(PSTR(__func__),PSTR("Sent to websocket client %d: %s\n"), id, buffer);
        }
        res = true;
        #endif
        #ifndef USE_ASYNC_WEB
        res = ws.sendTXT(id, buffer);
        #endif
        xSemaphoreGive( xSemaphoreWSSend );
      }
      else
      {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
      }
    }
  }
  return res;
}
#endif

#ifdef USE_DISK_LOG
void setupCardLogger()
{
  #ifdef USE_SDCARD_LOG
  sdSPI.begin(SD_SCLK, SD_MISO, SD_MOSI, SD_CS);
  if(!SD.begin(SD_CS, sdSPI)){
    log_manager->warn(PSTR(__func__), PSTR("Card Mount Failed.\n"));
    setAlarm(130, 1, 10, 500);
    return;
  }
  uint8_t cardType = SD.cardType();

  if(cardType == CARD_NONE){
    log_manager->warn(PSTR(__func__), PSTR("No SD card attached.\n"));
    setAlarm(131, 1, 10, 500);
    return;
  }

  if( xSemaphoreSettings != NULL && xSemaphoreTake( xSemaphoreSettings, ( TickType_t ) 1000 ) == pdTRUE )
  {
    config.cardSize = SD.cardSize() / (1024 * 1024);
    config.cardByte = SD.totalBytes();
    config.cardUsed = SD.usedBytes();
    xSemaphoreGive(xSemaphoreSettings);
  }
  if(cardType == CARD_MMC){
    log_manager->debug(PSTR(__func__), PSTR("SD Card Type: NNC, size: %lluMB - byte: %llu - used: %llu\n"), 
      config.cardSize, config.cardByte, config.cardUsed);
  } else if(cardType == CARD_SD){
    log_manager->debug(PSTR(__func__), PSTR("SD Card Type: SDSC, size: %lluMB - byte: %llu - used: %llu\n"), 
      config.cardSize, config.cardByte, config.cardUsed);
  } else if(cardType == CARD_SDHC){
    log_manager->debug(PSTR(__func__), PSTR("SD Card Type: SDHC, size: %lluMB - byte: %llu - used: %llu\n"), 
      config.cardSize, config.cardByte, config.cardUsed);
  } else {
    log_manager->debug(PSTR(__func__), PSTR("SD Card Type: UNKNOWN, size: %lluMB - byte: %llu - used: %llu\n"), 
      config.cardSize, config.cardByte, config.cardUsed);
  }
  #endif
}
#endif

#ifdef USE_DISK_LOG
void writeCardLogger(StaticJsonDocument<DOCSIZE_MIN> &doc)
{
  if( xSemaphoreCardLogger != NULL && xSemaphoreTake( xSemaphoreCardLogger, ( TickType_t ) 10000 ) == pdTRUE )
  {
    unsigned long ts; String fileName;
    if(rtc.getYear() < 2023)
    {
      fileName = "/www/log/recover.json";
      ts = millis();
    }
    else
    {
      fileName = "/www/log/" + String(rtc.getYear()) + "-" + String(rtc.getMonth()+1) + "-" + String(rtc.getDay()) + ".json";
      ts = rtc.getEpoch();
    }
    #ifdef USE_SDCARD_LOG
    File file = SD.open(fileName.c_str(), FILE_APPEND);
    #endif
    #ifdef USE_SPIFFS_LOG
    File file = SPIFFS.open(fileName.c_str(), FILE_APPEND);
    #endif
    if (!file) {
      log_manager->warn(PSTR(__func__), PSTR("Failed to create the log file %s!\n"), fileName.c_str());
      setAlarm(132, 1, 10, 500);
      xSemaphoreGive( xSemaphoreCardLogger );
      return;
    }
    doc[PSTR("ts")] = ts;
    if (serializeJson(doc, file) == 0) {
      setAlarm(133, 1, 10, 500);
      log_manager->warn(PSTR(__func__), PSTR("Failed to write to the log file %s!\n"), fileName.c_str());
    }
    else
    {
      file.println();
    }

    file.close();
    xSemaphoreGive( xSemaphoreCardLogger );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}

void deleteAllLogFiles() {
  log_manager->debug(PSTR(__func__), PSTR("Deleting all log files in /www/log\n"));

  if( xSemaphoreCardLogger != NULL && xSemaphoreTake( xSemaphoreCardLogger, ( TickType_t ) 0 ) == pdTRUE )
  {
    const String logDirectory = "/www/log/";

    #ifdef USE_SDCARD_LOG 
    File root = SD.open(logDirectory);
    #endif
    #ifdef USE_SPIFFS_LOG
    File root = SPIFFS.open(logDirectory.c_str());
    #endif
    if (!root || !root.isDirectory()){
      log_manager->error(PSTR(__func__), PSTR("Failed to open log directory %s"), logDirectory.c_str());
      xSemaphoreGive( xSemaphoreCardLogger );
      return; 
    }

    while (File file = root.openNextFile()) {
      if (file.path() != nullptr) {
        #ifdef USE_SDCARD_LOG 
        if(SD.remove(file.path)){
          log_manager->verbose(PSTR(__func__), PSTR("File %s deleted"), file.path());
        } else {
          log_manager->error(PSTR(__func__), PSTR("Failed to delete file %s"), file.path());
        }
        #endif
        #ifdef USE_SPIFFS_LOG
        if(SPIFFS.remove(file.path())){
          log_manager->verbose(PSTR(__func__), PSTR("File %s deleted"), file.path());
        } else {
          log_manager->error(PSTR(__func__), PSTR("Failed to delete file %s"), file.path());
        }
        #endif
        
