Narin-Laboratory/libudawa-esp32/src/libudawa.h
      }
      file.close();
    }

    xSemaphoreGive( xSemaphoreCardLogger );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}


void deleteLogFile(String fileName){
  log_manager->debug(PSTR(__func__), PSTR("Deleting log file: %s\n"), fileName.c_str());
  if( xSemaphoreCardLogger != NULL && xSemaphoreTake( xSemaphoreCardLogger, ( TickType_t ) 0 ) == pdTRUE )
  {
    String filePath = "/www/log/" + fileName;

    #ifdef USE_SDCARD_LOG
    if(SD.remove(filePath.c_str())){
      log_manager->verbose(PSTR(__func__), PSTR("File %s has been removed."), filePath.c_str());
    }
    else{
      log_manager->verbose(PSTR(__func__), PSTR("Failed to remove file %s."), filePath.c_str());
    }
    #endif
    #ifdef USE_SPIFFS_LOG
    if(SPIFFS.remove(filePath.c_str())){
      log_manager->verbose(PSTR(__func__), PSTR("File %s has been removed."), filePath.c_str());
    }else{
      log_manager->verbose(PSTR(__func__), PSTR("Failed to remove file %s."), filePath.c_str());
    }
    #endif

    xSemaphoreGive( xSemaphoreCardLogger );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}
#endif

#ifdef USE_WEB_IFACE
#ifdef USE_DISK_LOG
void wsStreamCardLogger(uint32_t id, String fileName)
{
  log_manager->debug(PSTR(__func__), PSTR("Sending log file of %s to %d!\n"), fileName.c_str(), id);
  if( xSemaphoreCardLogger != NULL && xSemaphoreTake( xSemaphoreCardLogger, ( TickType_t ) 0 ) == pdTRUE )
  {
    String filePath = "/www/log/" + fileName;

    #ifdef USE_SDCARD_LOG
    File file = SD.open(fileName.c_str(), FILE_READ);
    #endif
    #ifdef USE_SPIFFS_LOG
    File file = SPIFFS.open(filePath.c_str(), FILE_READ);
    #endif
    if (!file) {
      log_manager->warn(PSTR(__func__), PSTR("Failed to open the log file %s!\n"), filePath.c_str());
      xSemaphoreGive( xSemaphoreCardLogger );
      return;
    }

    while (true) {
      StaticJsonDocument<DOCSIZE_MIN> doc;
      char buffer[DOCSIZE_MIN];
      DeserializationError err = deserializeJson(doc, file);
      if (err) 
      {
        doc[PSTR("src")] = PSTR("card-end");
        serializeJson(doc, buffer);
        //wsSendTXT(id, buffer);
        wsBroadcastTXT(buffer);
        break;
      };
      doc[PSTR("src")] = PSTR("card");
      serializeJson(doc, buffer);
      //wsSendTXT(id, buffer);
      wsBroadcastTXT(buffer);
      vTaskDelay((const TickType_t) 50 / portTICK_PERIOD_MS);
    }

    file.close();

    xSemaphoreGive( xSemaphoreCardLogger );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}
#endif

#ifdef USE_ASYNC_WEB
void hashApiKeyWithSalt(const char* apiKey, const char* salt, char outputBuffer[65]) {
  // Convert input strings to UTF-8
  String apiKeyUtf8 = String(apiKey);
  String saltUtf8 = String(salt);

  // Calculate the HMAC
  byte hmac[32];
  const byte* key = (const byte*)apiKeyUtf8.c_str();
  size_t keyLength = apiKeyUtf8.length();
  const byte* message = (const byte*)saltUtf8.c_str();
  size_t messageLength = saltUtf8.length();
  mbedtls_md_context_t ctx;
  mbedtls_md_type_t md_type = MBEDTLS_MD_SHA256;

  mbedtls_md_init(&ctx);
  mbedtls_md_setup(&ctx, mbedtls_md_info_from_type(md_type), 1);
  mbedtls_md_hmac_starts(&ctx, key, keyLength);
  mbedtls_md_hmac_update(&ctx, message, messageLength);
  mbedtls_md_hmac_finish(&ctx, hmac);
  mbedtls_md_free(&ctx);

  // Convert the hash to a hex string
  for (int i = 0; i < 32; i++) {
    sprintf(&outputBuffer[i*2], "%02x", (unsigned int)hmac[i]);
  }
}
#endif
#endif

} // namespace libudawa
#endif
